import { ACCOUNTS } from '@/redux/actions/accounts';

const initState = {
  allPosts: [
    { date: '11-25-2019', level: 1, location: 'Луцьк, вул. Романа Шушхевича, бла бла бла бла бла бла', lat: 25.315382999999988, long: 50.71723299999999 },
    { date: '11-25-2019', level: 2, location: 'Луцьк, вул. Романа Шушхевича', lat: 25.353245799999968, long: 50.7427557 },
    { date: '11-25-2019', level: 1, location: 'Луцьк, вул. Романа Шушхевича', lat: 25.33233919999998, long: 50.7425516 },
    { date: '11-25-2019', level: 3, location: 'Луцьк, вул. Романа Шушхевича', lat: 25.3562120000000288, long: 50.7609511 },
    { date: '11-25-2019', level: 1, location: 'Луцьк, вул. Романа Шушхевича', lat: 25.3564576, long: 50.7616855 },
    { date: '11-25-2019', level: 5, location: 'Луцьк, вул. Романа Шушхевича', lat: 25.362295099999983, long: 50.767252 },
    { date: '11-24-2019', level: 1, location: 'Луцьк, вул. Романа Шушхевича', lat: 25.375382999999988, long: 50.77723299999999 },
    { date: '11-24-2019', level: 4, location: 'Луцьк, вул. Романа Шушхевича', lat: 25.375382999999988, long: 50.78723299999999 },
    { date: '11-24-2019', level: 4, location: 'Луцьк, вул. Романа Шушхевича', lat: 25.385382999999988, long: 50.79723299999999 },
    { date: '11-24-2019', level: 1, location: 'Луцьк, вул. Романа Шушхевича', lat: 25.315382999999988, long: 50.71023299999999 },
    { date: '11-23-2019', level: 3, location: 'Луцьк, вул. Романа Шушхевича', lat: 25.311582999999988, long: 50.71123299999999 },
    { date: '11-23-2019', level: 1, location: 'Луцьк, вул. Романа Шушхевича', lat: 25.312538299999988, long: 50.71223299999999 },
    { date: '11-23-2019', level: 2, location: 'Луцьк, вул. Романа Шушхевича', lat: 25.313538299999988, long: 50.71323299999999 },
    { date: '11-22-2019', level: 2, location: 'Луцьк, вул. Романа Шушхевича', lat: 25.3145382999999988, long: 50.71423299999999 },
    { date: '11-22-2019', level: 1, location: 'Луцьк, вул. Романа Шушхевича', lat: 25.3155382999999988, long: 50.71523299999999 },
    { date: '11-21-2019', level: 1, location: 'Луцьк, вул. Романа Шушхевича', lat: 25.3165382999999988, long: 50.71623299999999 },
    { date: '11-21-2019', level: 3, location: 'Луцьк, вул. Романа Шушхевича', lat: 25.175382999999988, long: 50.71723299999999 },
    { date: '11-21-2019', level: 3, location: 'Луцьк, вул. Романа Шушхевича', lat: 25.385382999999988, long: 50.71823299999999 },
    { date: '11-21-2019', level: 4, location: 'Луцьк, вул. Романа Шушхевича', lat: 25.315382999999988, long: 50.71923299999999 },
    { date: '11-20-2019', level: 1, location: 'Луцьк, вул. Романа Шушхевича', lat: 25.320382999999988, long: 50.72023299999999 },
    { date: '11-20-2019', level: 3, location: 'Луцьк, вул. Романа Шушхевича', lat: 25.321532999999988, long: 50.72123299999999 },
    { date: '11-20-2019', level: 3, location: 'Луцьк, вул. Романа Шушхевича', lat: 25.322538999999988, long: 50.72223299999999 },
    { date: '11-20-2019', level: 1, location: 'Луцьк, вул. Романа Шушхевича', lat: 25.323582999999988, long: 50.72323299999999 },
  ],
}

export default (state = initState, { type, payload }) => {
  switch (type) {
    case ACCOUNTS.CREATE:
      return {
        ...state,
        currentUser: payload,
      }
    default:
      return state;
  }
};
